In [2]:
import pandas as pd
import sqlite3

In [4]:
df = pd.read_csv("Sample - Superstore.csv")
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales
0,1,CA-2017-152156,08/11/2017,11/11/2017,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600
1,2,CA-2017-152156,08/11/2017,11/11/2017,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400
2,3,CA-2017-138688,12/06/2017,16/06/2017,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,California,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200
3,4,US-2016-108966,11/10/2016,18/10/2016,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775
4,5,US-2016-108966,11/10/2016,18/10/2016,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680

In [5]:
conn = sqlite3.connect("sales.db")
df.to_sql("sales", conn, if_exists="replace", index=False)

9800

In [7]:
pd.read_sql("SELECT * FROM sales LIMIT 5;", conn)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales
0,1,CA-2017-152156,08/11/2017,11/11/2017,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600
1,2,CA-2017-152156,08/11/2017,11/11/2017,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400
2,3,CA-2017-138688,12/06/2017,16/06/2017,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,California,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200
3,4,US-2016-108966,11/10/2016,18/10/2016,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775
4,5,US-2016-108966,11/10/2016,18/10/2016,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680

In [8]:
query = """
SELECT Category,
       ROUND(SUM(Sales), 2) AS total_sales
FROM sales
GROUP BY Category
ORDER BY total_sales DESC;
"""
pd.read_sql(query, conn)

          Category  total_sales
0       Technology    827455.87
1        Furniture    728658.58
2  Office Supplies    705422.33

In [11]:
query = """
SELECT State,
       ROUND(SUM(Sales), 2) AS total_sales
FROM sales
GROUP BY State
ORDER BY total_sales DESC
LIMIT 5;
"""
top_states = pd.read_sql(query, conn)
top_states

          State  total_sales
0    California    446306.46
1      New York    306361.15
2         Texas    168572.53
3    Washington    135206.85
4  Pennsylvania    116276.65

In [17]:
query = """
SELECT "Sub-Category",
       ROUND(AVG(Sales), 2) AS avg_sales
FROM sales
GROUP BY "Sub-Category"
ORDER BY avg_sales DESC;
"""
avg_sales = pd.read_sql(query, conn)
avg_sales.head(10)

  Sub-Category  avg_sales
0      Copiers    2215.88
1     Machines    1645.55
2       Tables     645.89
3       Chairs     531.83
4    Bookcases     503.60
5       Phones     374.18
6      Storage     263.63
7     Supplies     252.28
8   Appliances     227.93
9  Accessories     217.18

In [18]:
query = """
SELECT "Sub-Category",
       ROUND(SUM(Sales), 2) AS total_sales
FROM sales
GROUP BY "Sub-Category"
ORDER BY total_sales DESC
LIMIT 10;
"""
top_subcats = pd.read_sql(query, conn)
top_subcats

  Sub-Category  total_sales
0       Phones    327782.45
1       Chairs    322822.73
2      Storage    219343.39
3       Tables    202810.63
4      Binders    200028.79
5     Machines    189238.63
6  Accessories    164186.70
7      Copiers    146248.09
8    Bookcases    113813.20
9   Appliances    104618.40

In [ ]:
## Key Insights

- Technology is the highest-revenue category by total sales.
- Sales are concentrated in a small number of states, led by California and New York.
- Sub-category performance differs by metric: Copiers rank highest by average sales per order, while Phones generate the highest total revenue.